dotfiles/doom.d/config.org
#+TITLE: Taris' Doomemacs Configuration!!
#+AUTHOR: Taylor Shin
#+PROPERTY: header-args :tangle-mode

* Contents :toc:
- [[#init-file-initel][Init file (init.el)]]
- [[#package-list-packagesel][Package list (packages.el)]]
- [[#packages-configuration-configel][Packages Configuration (config.el)]]
  - [[#distrotubes-gitlab][DistroTube's Gitlab.]]
  -  [[#also-referenced][Also referenced]]
  -  [[#hangul-stuffs-are-referenced-from][Hangul stuffs are referenced from...]]
  -  [[#distro-detection-elisp-code-was-adopted-from][Distro detection elisp code was adopted from...]]
  -  [[#zzamboni-had-some-useful-macros][Zzamboni had some useful macros...]]
- [[#my-credentials][My credentials]]
- [[#window-titles-and-bookmarking][Window Titles and Bookmarking]]
  - [[#header][Header]]
  - [[#window-title][Window title]]
  - [[#bookmarking][Bookmarking]]
- [[#navigation][Navigation]]
  - [[#dired-directory-manager][Dired directory manager]]
  - [[#centaur-tabs][Centaur tabs]]
- [[#theme][Theme!]]
- [[#window-management][Window Management]]
  - [[#window-navigation][Window Navigation]]
  - [[#line-number-manipulation-and-comment][Line number manipulation and Comment]]
  - [[#window-splits][Window Splits]]
  - [[#winner-mode][Winner Mode]]
- [[#shortcut-keys-for-settings][Shortcut Keys for Settings]]
  - [[#quick-settings-edit-shortcuts][Quick Settings Edit Shortcuts]]
- [[#org-mode][Org mode]]
  - [[#basic-org-mode-setup][Basic Org mode setup]]
  - [[#shortcut-for-src-blocks][Shortcut for SRC blocks]]
  - [[#automatic-tangle][Automatic Tangle!]]
  - [[#header-arguments][Header arguments]]
  - [[#buffer-creation][Buffer Creation]]
  - [[#bullet-mode-sequence][Bullet mode sequence]]
  - [[#view-exported-file][View Exported File]]
  - [[#html-export][HTML Export]]
  - [[#toc-as-a-collapsable-tree][TOC As a Collapsable Tree]]
- [[#fonts][Fonts]]
  - [[#doom-font-config][Doom Font config.]]
- [[#ivy-mode][Ivy Mode]]
  - [[#ivy-posframe][Ivy-Posframe]]
  - [[#ivy-keybindings][Ivy Keybindings]]
- [[#registers-clipboard-system][Registers (clipboard system?)]]
- [[#shell-settings][Shell Settings]]
  - [[#emacs-shell-settings][Emacs shell settings.]]
  - [[#aliases-for-eshell][Aliases for eshell]]
- [[#hangul-stuff][Hangul stuff]]
  - [[#editor-font-settings][Editor Font Settings]]
  - [[#font-size-matching][Font Size Matching]]
- [[#evaluate-elisp-expressions][Evaluate Elisp expressions.]]
- [[#news-and-media-stuffs][News and Media Stuffs]]
  - [[#elfeed-stuff][Elfeed stuff]]
  - [[#emms-music-player-stuff][EMMS music player stuff]]
  - [[#ews-web-browser][EWS Web browser]]
- [[#misc-stuffs][Misc stuffs]]
  - [[#os-x-apple-machines-modifiers-to-be-more-sane][OS X (Apple machines) modifiers to be more 'sane']]
  - [[#file-management-stuff][File management stuff]]
  - [[#more-undos][More Undos!]]
  - [[#window-split-behaviors][Window Split Behaviors]]
  - [[#show-battery-status][Show battery status]]
  - [[#graphviz][Graphviz]]
  - [[#iedit-settings][iEdit settings]]
  - [[#measure-time-macro][measure-time macro]]
  - [[#initial-window-size][Initial Window Size]]
  - [[#exit-messages-are-annoying][Exit messages are... Annoying]]

* Init file (init.el)
Here's init.el file for Doomemacs. Fundamental set ups are all done here. However, in openSUSE, they have some other settings on =/usr/share/X11/app-defaults/Emacs= file. I'm not sure why custom compiled Emacs follows this file's configuration though. The gnu.org clearly mentions that Emacs will search user's directory first.

#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-
(doom! :input
       ;;chinese
       ;;japanese
       ;;layout            ; auie,ctsrnm is the superior home row

       :completion
       (company           ; the ultimate code completion backend
        +childframe)      ; ... when your children are better than you.
       ;;helm              ; the *other* search engine for love and life
       ;;ido               ; the other *other* search engine...
       (ivy               ; a search engine for love and life
        +icons
        +perscient
        +ivyposframe
        +fonts)

       :ui
       ;;deft              ; notational velocity for Emacs
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       ;; doom-quit         ; DOOM quit-message prompts when you quit Emacs
       (emoji +unicode)  ; 🙂
       ;;fill-column       ; a `fill-column' indicator
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       ;;hydra
       ;;indent-guides     ; highlighted indent columns
       (ligatures +extra)         ; ligatures and symbols to make your code pretty again
       minimap           ; show a map of the code on the side
       modeline          ; snazzy, Atom-inspired modeline, plus API
       ;; nav-flash         ; blink cursor line after big motions
       ;; neotree           ; a project drawer, like NERDTree for vim
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       tabs              ; a tab bar for Emacs
       ;; treemacs          ; a project drawer, like neotree but cooler
       ;; unicode           ; extended unicode support for various languages
       vc-gutter         ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       (window-select
        +numbers); visually switch windows
       workspaces        ; tab emulation, persistence & separate workspaces
       zen               ; distraction-free coding or writing

       :editor
       (evil +everywhere); come to the dark side, we have cookies
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       (format +onsave)  ; automated prettiness
       ;;god               ; run Emacs commands without modifier keys
       ;;lispy             ; vim for lisp, for people who don't like vim
       multiple-cursors  ; editing in many places at once
       ;;objed             ; text object editing for the innocent
       ;;parinfer          ; turn lisp into python, sort of
       ;; rotate-text       ; cycle region at point between text candidates
       snippets          ; my elves. They type so I don't have to
       word-wrap         ; soft wrapping with language-aware indent

       :emacs
       (dired +icons)             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       (ibuffer +icons)         ; interactive buffer management
       (undo +tree)              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree

       :term
       eshell            ; the elisp shell that works everywhere
       shell             ; simple shell REPL for Emacs
       term              ; basic terminal emulator for Emacs
       vterm             ; the best terminal emulation in Emacs

       :checkers
       syntax              ; tasing you for every semicolon you forget
       (:if (executable-find "aspell") spell +flyspell) ; tasing you for misspelling mispelling
       grammar           ; tasing grammar mistake every you make

       :tools
       ;; ansible
       ;;debugger          ; FIXME stepping through code, to help you add bugs
       ;;direnv
       ;; docker
       ;;editorconfig      ; let someone else argue about tabs vs spaces
       ;;ein               ; tame Jupyter notebooks with emacs
       (eval +overlay)     ; run code, run (also, repls)
       ;;gist              ; interacting with github gists
       (lookup
        +dictionary
        +docsets); navigate your code and its documentation
       lsp
       (magit +forge)             ; a git porcelain for Emacs
       make              ; run make tasks from Emacs
       ;;pass              ; password manager for nerds
       ;;pdf               ; pdf enhancements
       ;;prodigy           ; FIXME managing external services & code builders
       ;;rgb               ; creating color strings
       ;;taskrunner        ; taskrunner for all your projects
       ;;terraform         ; infrastructure as code
       ;;tmux              ; an API for interacting with tmux
       upload            ; map local to remote projects via ssh/ftp

       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       tty               ; improve the terminal Emacs experience

       :lang
       ;;agda              ; types of types of types of types...
       cc                ; C/C++/Obj-C madness
       ;;clojure           ; java with a lisp
       ;;common-lisp       ; if you've seen one lisp, you've seen them all
       ;;coq               ; proofs-as-programs
       ;;crystal           ; ruby at the speed of c
       csharp            ; unity, .NET, and mono shenanigans
       data              ; config/data formats
       ;;(dart +flutter)   ; paint ui and not much else
       ;;elixir            ; erlang done right
       ;;elm               ; care for a cup of TEA?
       emacs-lisp        ; drown in parentheses
       ;;erlang            ; an elegant language for a more civilized age
       ;;ess               ; emacs speaks statistics
       ;;faust             ; dsp, but you get to keep your soul
       ;;fsharp            ; ML stands for Microsoft's Language
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
       ;;gdscript          ; the language you waited for
       (go +lsp)         ; the hipster dialect
       (haskell +dante)  ; a language that's lazier than I am
       ;;hy                ; readability of scheme w/ speed of python
       ;;idris             ; a language you can depend on
       json              ; At least it ain't XML
       (java +meghanada) ; the poster child for carpal tunnel syndrome
       javascript        ; all(hope(abandon(ye(who(enter(here))))))
       julia             ; a better, faster MATLAB
       ;;kotlin            ; a better, slicker Java(Script)
       (latex
        +latexmk
        ;; +cdlatex
        +fold); writing papers in Emacs has never been so fun
       ;;lean
       ;;factor
       ;;ledger            ; an accounting system in Emacs
       lua               ; one-based indices? one-based indices
       markdown          ; writing docs for people to ignore
       ;;nim               ; python + lisp at the speed of c
       ;;nix               ; I hereby declare "nix geht mehr!"
       ;;ocaml             ; an objective camel
       (org                     ; organize your plain life in plain text
        +pretty
        +dragndrop
        ;;+hugo
        +noter
        +jupyter
        +pandoc
        +gnuplot
        ;;+pomodoro
        +present
        +org-bullets
        +org-ql)
       php               ; perl's insecure younger brother
       ;;plantuml          ; diagrams for confusing people more
       ;;purescript        ; javascript, but functional
       (python +lsp +pyright)           ; beautiful is better than ugly
       qt                ; the 'cutest' gui framework ever
       ;;racket            ; a DSL for DSLs
       raku              ; the artist formerly known as perl6
       ;;rest              ; Emacs as a REST client
       ;;rst               ; ReST in peace
       (ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
       (rust +lsp)              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       ;; scala             ; java, but good
       ;; scheme            ; a fully conniving family of lisps
       (sh +fish)                ; she sells {ba,z,fi}sh shells on the C xor
       ;;sml
       ;;solidity          ; do you need a blockchain? No.
       ;;swift             ; who asked for emoji variables?
       ;;terra             ; Earth and Moon in alignment for performance.
       web               ; the tubes
       yaml              ; JSON, but readable

       :email
       (:if (executable-find "mu") (mu4e +org +gmail))
       ;;notmuch
       ;;(wanderlust +gmail)

       :app
       ;;calendar
       ;; emms
       ;; everywhere        ; *leave* Emacs!? You must be joking
       ;; irc               ; how neckbeards socialize
       ;;(rss +org)        ; emacs as an RSS reader
       ;;twitter           ; twitter client https://twitter.com/vnought

       :emms
       ;;emms-setup
       ;;emms-info
       ;;emms-cue
       ;;emms-mode-line

       :config
       ;;literate
       (default +bindings +smartparens)
       )
#+end_src

* Package list (packages.el)
#+begin_src emacs-lisp :tangle packages.el
;;; packages.el -*- lexical-binding: t; -*-
(package! all-the-icons-dired)
(package! flycheck-aspell)
(package! async)
(package! dired-open)
;; (package! dmenu)
;; (package! elfeed)
;; (package! elpher)
;; (package! emms)
(package! emojify)
(package! evil-tutor)
(package! ivy-posframe)
(package! mastodon)
(package! org-bullets)
(package! org-ql)
(package! peep-dired)
(package! pianobar)
(package! rainbow-mode)
(package! resize-window)
(package! tldr)
(package! wc-mode)
(package! writeroom-mode)
(package! rotate) ; Window pin
(package! info-colors) ; Pretty manual
(package! systemd) ; Editing systemd unit files
(package! graphviz-dot-mode) ; graphviz
(package! org-auto-tangle) ; org tangle
(package! elvish-mode)
(package! ob-elvish)
(package! ob-cfengine3)
(package! iedit)
(package! annotate)
#+end_src

* Packages Configuration (config.el)
:PROPERTIES:
:header-args: :tangle config.el
:END:
Many settings were imported from these sources.

** DistroTube's Gitlab.
    [[https://gitlab.com/dwt1/dotfiles/-/blob/master/.doom.d/config.org][DistroTube's GitLab repo. doom.d/config.org]]

**  Also referenced
    [[https://tecosaur.github.io/emacs-config/config.html][Tecosaur's github
]]
**  Hangul stuffs are referenced from...
    [[https://m.blog.naver.com/PostView.nhn?blogId=jodi999&logNo=221256569685&proxyReferer=https:%2F%2Fwww.google.com%2F][멍's Naver blog]]

**  Distro detection elisp code was adopted from...
    [[https://emacs.stackexchange.com/a/44292][Yong Cheng's Answer at Stack Exchange.]]

**  Zzamboni had some useful macros...
    [[https://zzamboni.org/post/my-doom-emacs-configuration-with-commentary/][Zzamboni.org]]

* My credentials
:PROPERTIES:
:header-args: :tangle config.el
:END:
#+begin_src emacs-lisp
(setq user-full-name "Taylor Shin"
      user-mail-address "talezshin@gmail.com")
#+end_src
* Window Titles and Bookmarking
:PROPERTIES:
:header-args: :tangle config.el
:END:
** Header
Setting up =lexical-binding= for this file.
#+begin_src emacs-lisp
;;; ./config.el -*- lexical-binding: t; -*-
#+end_src

** Window title
#+begin_src emacs-lisp
;; Fallback buffer names
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+end_src

** Bookmarking
#+begin_src emacs-lisp
(map! :leader
      :desc "List bookmarks"
      "b L" #'list-bookmarks
      :leader
      :desc "Save current bookmarks to bookmark file"
      "b w" #'bookmark-save)
#+end_src

* Navigation
:PROPERTIES:
:header-args: :tangle config.el
:END:
