dotfiles/doom.d/config.el
(setq user-full-name "Taylor Shin"
      user-mail-address "talezshin@gmail.com")

;;; ./config.el -*- lexical-binding: t; -*-

;; Fallback buffer names
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

(map! :leader
      :desc "List bookmarks"
      "b L" #'list-bookmarks
      :leader
      :desc "Save current bookmarks to bookmark file"
      "b w" #'bookmark-save)

(map! :leader
      :desc "Dired"
      "d d" #'dired
      :leader
