dotfiles/doom.d/config.org
* Registers (clipboard system?)
:PROPERTIES:
:header-args: :tangle config.el
:END:

I'm not sure I would utilize it frequently. But at least it seems pretty neat to have. Emacs can do everything that KDE do... huh.

| COMMAND                          | DESCRIPTION                      | KEYBINDING |
|----------------------------------+----------------------------------+------------|
| copy-to-register                 | /Copy to register/                 | SPC r c    |
| frameset-to-register             | /Frameset to register/             | SPC r f    |
| insert-register                  | /Insert contents of register/      | SPC r i    |
| jump-to-register                 | /Jump to register/                 | SPC r j    |
| list-registers                   | /List registers/                   | SPC r l    |
| number-to-register               | /Number to register/               | SPC r n    |
| counsel-register                 | /Interactively choose a register/  | SPC r r    |
| view-register                    | /View a register/                  | SPC r v    |
| window-configuration-to-register | /Window configuration to register/ | SPC r w    |
| increment-register               | /Increment register/               | SPC r +    |
| point-to-register                | /Point to register/                | SPC r SPC  |

#+begin_src emacs-lisp
(map! :leader
      :desc "Copy to register"
      "r c" #'copy-to-register
      :leader
      :desc "Frameset to register"
      "r f" #'frameset-to-register
      :leader
      :desc "Insert contents of register"
      "r i" #'insert-register
      :leader
      :desc "Jump to register"
      "r j" #'jump-to-register
      :leader
      :desc "List registers"
      "r l" #'list-registers
      :leader
      :desc "Number to register"
      "r n" #'number-to-register
      :leader
      :desc "Interactively choose a register"
      "r r" #'counsel-register
      :leader
      :desc "View a register"
      "r v" #'view-register
      :leader
      :desc "Window configuration to register"
      "r w" #'window-configuration-to-register
      :leader
      :desc "Increment register"
      "r +" #'increment-register
      :leader
      :desc "Point to register"
      "r SPC" #'point-to-register)
#+end_src

* Shell Settings
** Emacs shell settings.
#+begin_src emacs-lisp
(setq shell-file-name "/bin/bash"
      eshell-aliases-file "~/.doom.d/aliases"
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh")
      vterm-max-scrollback 5000)
(map! :leader
      :desc "Eshell" "e s" #'eshell
      :desc "Counsel eshell history" "e h" #'counsel-esh-history)
#+end_src

** Aliases for eshell
Some aliases for eshell usage. eshell is not your regular shell such as bash, zsh, etc. It is completely written with Emacs Lisp language and only usable in Emacs. Quite interesting, eh?

#+begin_src emacs-lisp :tangle aliases
alias ls exa -al --color=always --group-directories-first
alias ff find-file $1
alias doomsync ~/.emacs.d/bin/doom sync
alias doomdoctor ~/.emacs.d/bin/doom doctor
alias doomupgrade ~/.emacs.d/bin/doom upgrade
alias doompurge ~/.emacs.d/bin/doom purge
#+end_src

* Hangul stuff
:PROPERTIES:
:header-args: :tangle config.el
:END:
Apparently, Emacs doesn't work well with xdg based input methods such as iBus, Fcitx, etc. So, even though Emacs runs on GUI environment, changing input method on Emacs was not so easy.

But Emacs has everything! Even hangul input method!! Huh!

So, I've decided to use it. The default Hangul/English switching keystroke is the Shift Space which was an industry(?) standard within Korean opensource community. However, times change, we can now map Right Alt key as Hangul on X input. So, why not? Implementing Hangul/English key on Emacs was not very challenging these days.

We may not use Hanja key on Emacs... Maybe we need to find some other way later... LaTeXing still needs Hanja input for some specific cases.

** Editor Font Settings
#+begin_src emacs-lisp
(setq default-input-method "korean-hangul")
(global-set-key (kbd "S-SPC") 'toggle-input-method)
;; Be sure to enable hardware Hangul key from Keyboard(XKB) Options to use this.
(global-set-key (kbd "<Hangul>") 'toggle-input-method)
;; (global-set-key (kbd "<Ctrl_R>") 'toggle-input-method)
(global-set-key (kbd "<Alt_R>") 'toggle-input-method)
(when (eq system-type 'gnu/linux)
  (set-fontset-font t 'hangul (font-spec :family "Noto Sans CJK KR" :size 16))
  )
#+end_src
** Font Size Matching

| Font Test English | 한글 폰트 크기 |
|-------------------+----------------|
| English font!     | 한글 폰트 예시 |

Well, it needs a lot of iterative effort to make it work... Check up the table width above to find out the best size ratio.

#+begin_src emacs-lisp
(setq face-font-rescale-alist
      '((".*hiragino.*" . 1.25)
        ("Noto Sans CJK KR" . 1.25)))
#+end_src

Even though you successfully match the width.. the height difference will be pretty drastic... and ugly.

* Evaluate Elisp expressions.
:PROPERTIES:
:header-args: :tangle config.el
:END:
Some handy dev assistant for emacs-lisp language. A must have for elisp addicts.

#+begin_src emacs-lisp
(map! :leader
      :desc "Evaluate elisp in buffer"
      "e b" #'eval-buffer
      :leader
      :desc "Evaluate defun"
      "e d" #'eval-defun
      :leader
      :desc "Evaluate elisp expression"
      "e e" #'eval-expression
      :leader
      :desc "Evaluate last sexpression"
      "e l" #'eval-last-sexp
      :leader
      :desc "Evaluate elisp in region"
      "e r" #'eval-region)
#+end_src
* News and Media Stuffs
:PROPERTIES:
:header-args: :tangle config.el
:END:

This part is being deprecated now. I prefer to use a dedicated GUI tool, not a crude Emacs based implementations. These days, most of Linux installation support GUI interface and there are tons of beginner friendly Linux distributions and they all claim 'an excellent GUI'!! So, why would one stick to those stupid terminal based old school programs? Unless needed, of course.

** Elfeed stuff
RSS Feed from DistroTube. I'll change them later but I do not really rely on them. Most of people alreay relays immediate news via a lot of channel. So, missing an important news is pretty hard anyway.

#+begin_src emacs-lisp
;; (custom-set-variables
;;  '(elfeed-feeds
;;    (quote
;;     (("https://www.reddit.com/r/linux.rss" reddit linux)
;;      ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
;;      ("https://hackaday.com/blog/feed/" hackaday linux)
;;      ("https://opensource.com/feed" opensource linux)
;;      ("https://linux.softpedia.com/backend.xml" softpedia linux)
;;      ("https://itsfoss.com/feed/" itsfoss linux)
;;      ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
;;      ("https://www.phoronix.com/rss.php" phoronix linux)
;;      ("http://feeds.feedburner.com/d0od" omgubuntu linux)
;;      ("https://www.computerworld.com/index.rss" computerworld linux)
;;      ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
;;      ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
;;      ("https://betanews.com/feed" betanews linux)
;;      ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
;;      ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))
#+end_src

** EMMS music player stuff

MPV was mandatory for this. In fact, this player isn't actually a player but yet another front end for MPV. Huh.

#+begin_src emacs-lisp
;; (emms-all)
;; (emms-default-players)
;; (emms-mode-line 1)
;; (emms-playing-time 1)
;; (setq emms-source-file-default-directory "~/Music/"
;;       emms-playlist-buffer-name "*Music*"
;;       emms-info-asynchronously t
;;       emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
;; (map! :leader
;;       :desc "Go to emms playlist"
;;       "a a" #'emms-playlist-mode-go
;;       :leader
;;       :desc "Emms pause track"
;;       "a x" #'emms-pause
;;       :leader
;;       :desc "Emms stop track"
;;       "a s" #'emms-stop
;;       :leader
;;       :desc "Emms play previous track"
;;       "a p" #'emms-previous
;;       :leader
;;       :desc "Emms play next track"
;;       "a n" #'emms-next)
#+end_src

** EWS Web browser
#+begin_src emacs-lisp
;; (setq browse-url-browser-function 'eww-browse-url)
;; (map! :leader
;;       :desc "Eww web browser"
;;       "e w" #'eww
;;       :leader
;;       :desc "Eww reload page"
;;       "e R" #'eww-reload
;;       :leader
;;       :desc "Search web for text between BEG/END"
;;       "s w" #'eww-search-words)
#+end_src

* Misc stuffs
:PROPERTIES:
:header-args: :tangle config.el
:END:
** OS X (Apple machines) modifiers to be more 'sane'

This code has not been tested since my financial situation cannot support any newer Apple products and all the Apple machines in my inventory are abandoned old models. So, they were wiped out to run Linux instead of legacy OS X.

#+begin_src emacs-lisp
(cond (IS-MAC
       (setq mac-command-modifier 'meta
             mac-option-modifier 'alt
             mac-right-option-modifier 'alt)))
#+end_src

** File management stuff
#+begin_src emacs-lisp
;; File management stuff
(setq-default
 delete-by-moving-to-trash t
 window-combination-resize t
 x-stretch-cursor t)
#+end_src

** More Undos!
#+begin_src emacs-lisp
;; Moar undos!
(setq undo-limit 800000000
      evil-want-fine-undo t
      truncate-string-ellipsis "…")
#+end_src

** Window Split Behaviors
Horizontal split is more preferred these days: Wide monitors!!
#+begin_src emacs-lisp
(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clone indirect buffer other window" "b c" #'clone-indirect-buffer-other-window)
#+end_src

** Show battery status
#+begin_src emacs-lisp
(if (equal "Battery status not available"
           (battery))
    (display-battery-mode 1)
  (setq password-cache-expiry nil))
(global-subword-mode 1)
#+end_src

** Graphviz
Plotting tool!

#+begin_src emacs-lisp
(use-package! graphviz-dot-mode)
#+end_src

** iEdit settings
Pattern matching edit mode. Pretty useful!

#+begin_src emacs-lisp
(use-package! iedit
  :defer
  :config
  (set-face-background 'iedit-occurrence "Magneta")
  :bind
  ("C-;" . iedit-mode))
#+end_src

** measure-time macro
#+begin_src emacs-lisp
(defmacro ts/measure-time (&rest body)
  "Measure the time it takes to evaluate BODY."
  `(let ((time (current-time)))
     ,@body
     (float-time (time-since time))))
#+end_src

