dotfiles/doom.d/config.el
      :desc "Copy to register"
      "r c" #'copy-to-register
      :leader
      :desc "Frameset to register"
      "r f" #'frameset-to-register
      :leader
      :desc "Insert contents of register"
      "r i" #'insert-register
      :leader
      :desc "Jump to register"
      "r j" #'jump-to-register
      :leader
      :desc "List registers"
      "r l" #'list-registers
      :leader
      :desc "Number to register"
      "r n" #'number-to-register
      :leader
      :desc "Interactively choose a register"
      "r r" #'counsel-register
      :leader
      :desc "View a register"
      "r v" #'view-register
      :leader
      :desc "Window configuration to register"
      "r w" #'window-configuration-to-register
      :leader
      :desc "Increment register"
      "r +" #'increment-register
      :leader
      :desc "Point to register"
      "r SPC" #'point-to-register)

(setq default-input-method "korean-hangul")
(global-set-key (kbd "S-SPC") 'toggle-input-method)
;; Be sure to enable hardware Hangul key from Keyboard(XKB) Options to use this.
(global-set-key (kbd "<Hangul>") 'toggle-input-method)
;; (global-set-key (kbd "<Ctrl_R>") 'toggle-input-method)
(global-set-key (kbd "<Alt_R>") 'toggle-input-method)
(when (eq system-type 'gnu/linux)
  (set-fontset-font t 'hangul (font-spec :family "Noto Sans CJK KR" :size 16))
  )

(setq face-font-rescale-alist
      '((".*hiragino.*" . 1.25)
        ("Noto Sans CJK KR" . 1.25)))

(map! :leader
      :desc "Evaluate elisp in buffer"
      "e b" #'eval-buffer
      :leader
      :desc "Evaluate defun"
      "e d" #'eval-defun
      :leader
      :desc "Evaluate elisp expression"
      "e e" #'eval-expression
      :leader
      :desc "Evaluate last sexpression"
      "e l" #'eval-last-sexp
      :leader
      :desc "Evaluate elisp in region"
      "e r" #'eval-region)

;; (custom-set-variables
;;  '(elfeed-feeds
;;    (quote
;;     (("https://www.reddit.com/r/linux.rss" reddit linux)
;;      ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
;;      ("https://hackaday.com/blog/feed/" hackaday linux)
;;      ("https://opensource.com/feed" opensource linux)
;;      ("https://linux.softpedia.com/backend.xml" softpedia linux)
;;      ("https://itsfoss.com/feed/" itsfoss linux)
;;      ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
;;      ("https://www.phoronix.com/rss.php" phoronix linux)
;;      ("http://feeds.feedburner.com/d0od" omgubuntu linux)
;;      ("https://www.computerworld.com/index.rss" computerworld linux)
;;      ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
;;      ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
;;      ("https://betanews.com/feed" betanews linux)
;;      ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
;;      ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))

;; (emms-all)
;; (emms-default-players)
;; (emms-mode-line 1)
;; (emms-playing-time 1)
;; (setq emms-source-file-default-directory "~/Music/"
;;       emms-playlist-buffer-name "*Music*"
;;       emms-info-asynchronously t
;;       emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
;; (map! :leader
;;       :desc "Go to emms playlist"
;;       "a a" #'emms-playlist-mode-go
;;       :leader
;;       :desc "Emms pause track"
;;       "a x" #'emms-pause
;;       :leader
;;       :desc "Emms stop track"
;;       "a s" #'emms-stop
;;       :leader
;;       :desc "Emms play previous track"
;;       "a p" #'emms-previous
;;       :leader
;;       :desc "Emms play next track"
;;       "a n" #'emms-next)

;; (setq browse-url-browser-function 'eww-browse-url)
;; (map! :leader
;;       :desc "Eww web browser"
;;       "e w" #'eww
;;       :leader
;;       :desc "Eww reload page"
;;       "e R" #'eww-reload
;;       :leader
;;       :desc "Search web for text between BEG/END"
;;       "s w" #'eww-search-words)

(cond (IS-MAC
       (setq mac-command-modifier 'meta
             mac-option-modifier 'alt
             mac-right-option-modifier 'alt)))

;; File management stuff
(setq-default
 delete-by-moving-to-trash t
 window-combination-resize t
 x-stretch-cursor t)

;; Moar undos!
(setq undo-limit 800000000
      evil-want-fine-undo t
      truncate-string-ellipsis "…")

(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clone indirect buffer other window" "b c" #'clone-indirect-buffer-other-window)

(if (equal "Battery status not available"
           (battery))
    (display-battery-mode 1)
  (setq password-cache-expiry nil))
(global-subword-mode 1)

(use-package! graphviz-dot-mode)

(use-package! iedit
  :defer
  :config
  (set-face-background 'iedit-occurrence "Magneta")
  :bind
  ("C-;" . iedit-mode))

(defmacro ts/measure-time (&rest body)
  "Measure the time it takes to evaluate BODY."
  `(let ((time (current-time)))
     ,@body
     (float-time (time-since time))))
