dotfiles/doom.d/config.org
** Initial Window Size
When not using automatic tiling window manager, this is useful...
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(height . 45) )
(add-to-list 'default-frame-alist '(width . 70) )
#+end_src

** Exit messages are... Annoying
Copied from [[https://www.reddit.com/r/emacs/comments/4aikhh/exit_message/][jsled's comment]] on /r/emacs.
#+begin_src emacs-lisp
(defun save-buffers-kill-emacs-with-confirm ()
 "jsled's special save-buffers-kill-emacs, but with confirm"
 (interactive)
 (if (null current-prefix-arg)
     (if (y-or-n-p "Are you sure you want to quit?")
         (save-buffers-kill-emacs))
     (save-buffers-kill-emacs)))
(global-set-key "\C-x\C-c" 'save-buffers-kill-emacs-with-confirm)
#+end_src
